bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_std/BSP_Driver/hal_drv/src/hal_usb.c
    return 0;
}

int usbd_ep_close(const uint8_t ep)
{
    return 0;
}

/**
 * @brief Set stall condition for the selected endpoint
 *
 * @param[in] ep Endpoint address corresponding to the one
 *               listed in the device configuration table
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_set_stall(const uint8_t ep)
{
    uint32_t tmpVal = 0;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (USB_EP_DIR_IS_OUT(ep)) {
        usb_fs_device.out_ep[ep_idx].is_stalled = 1U;
    } else {
        usb_fs_device.in_ep[ep_idx].is_stalled = 1U;
    }

    switch (ep_idx) {
        case 0:
            tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_STALL);
            BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);
            break;
        case 1:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_STALL);
            BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
            break;
        case 2:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_STALL);
            BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
            break;
        case 3:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_STALL);
            BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
            break;
        case 4:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_STALL);
            BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
            break;
        case 5:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_STALL);
            BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
            break;
        case 6:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_STALL);
            BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
            break;
        case 7:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_STALL);
            BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
            break;

        default:
            break;
    }
    return 0;
}
/**
 * @brief Clear stall condition for the selected endpoint
 *
 * @param[in] ep Endpoint address corresponding to the one
 *               listed in the device configuration table
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_clear_stall(const uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint32_t tmpVal = 0;
    if (USB_EP_DIR_IS_OUT(ep)) {
        usb_fs_device.out_ep[ep_idx].is_stalled = 0;
    } else {
        usb_fs_device.in_ep[ep_idx].is_stalled = 0;
    }
    switch (ep_idx) {
        case 0:
            break;
        case 1:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP1_STALL);
            BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
            break;
        case 2:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP2_STALL);
            BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
            break;
        case 3:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP3_STALL);
            BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
            break;
        case 4:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP4_STALL);
            BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
            break;
        case 5:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP5_STALL);
            BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
            break;
        case 6:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP6_STALL);
            BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
            break;
        case 7:
            tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_RDY);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_NACK);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP7_STALL);
            BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
            break;

        default:
            break;
    }
    return 0;
}

/**
 * @brief Check if the selected endpoint is stalled
 *
 * @param dev usb device
 * @param[in]  ep       Endpoint address corresponding to the one
 *                      listed in the device configuration table
 * @param[out] stalled  Endpoint stall status
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_is_stalled(struct device *dev, const uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!stalled) {
        return -1;
    }

