bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_std/BSP_Driver/hal_drv/src/hal_usb.c
    if (read_bytes) {
        *read_bytes = read_count;
    }

    return USB_DC_OK;
}

extern void usbd_event_notify_handler(uint8_t event, void *arg);

void USBD_IRQHandler(void)
{
    USB_EP_ID epnum = EP_ID0;

    /* EP1_DONE -> EP2_DONE -> ...... -> EP7_DONE*/
    for (USB_INT_Type epint = USB_INT_EP1_DONE; epint <= USB_INT_EP7_DONE; epint += 2) {
        if (USB_Get_IntStatus(epint)) {
            epnum = (epint - USB_INT_EP0_OUT_CMD) >> 1;
            if (!USB_Is_EPx_RDY_Free(epnum) && (usb_fs_device.out_ep[epnum].ep_cfg.ep_type != USBD_EP_TYPE_ISOC)) {
                USB_DC_LOG_ERR("ep%d out busy\r\n", epnum);
                continue;
            }
            USB_Clr_IntStatus(epint);
            usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(epnum & 0x7f));
        }
    }

    /* EP1_CMD -> EP2_CMD -> ...... -> EP7_CMD*/
    for (USB_INT_Type epint = USB_INT_EP1_CMD; epint <= USB_INT_EP7_CMD; epint += 2) {
        if (USB_Get_IntStatus(epint)) {
            epnum = (epint - USB_INT_EP0_OUT_CMD) >> 1;
            if (!USB_Is_EPx_RDY_Free(epnum) && (usb_fs_device.in_ep[epnum].ep_cfg.ep_type != USBD_EP_TYPE_ISOC)) {
                USB_DC_LOG_DBG("ep%d in busy\r\n", epnum);
                continue;
            }
            USB_Clr_IntStatus(epint);
            usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(epnum | 0x80));
        }
    }

    /* EP0 setup done */
    if (USB_Get_IntStatus(USB_INT_EP0_SETUP_DONE)) {
        if (!USB_Is_EPx_RDY_Free(0)) {
            USB_DC_LOG_DBG("ep0 setup busy\r\n");
            return;
        }
        USB_Clr_IntStatus(USB_INT_EP0_SETUP_DONE);
        usbd_event_notify_handler(USB_DC_EVENT_SETUP_NOTIFY, NULL);
        USB_Set_EPx_Rdy(EP_ID0);
        return;
    }

    /* EP0 in done */
    if (USB_Get_IntStatus(USB_INT_EP0_IN_DONE)) {
        if (!USB_Is_EPx_RDY_Free(0)) {
            USB_DC_LOG_DBG("ep0 in busy\r\n");
            return;
        }
        USB_Clr_IntStatus(USB_INT_EP0_IN_DONE);
        usbd_event_notify_handler(USB_DC_EVENT_EP0_IN_NOTIFY, NULL);
        USB_Set_EPx_Rdy(EP_ID0);
        return;
    }

    /* EP0 out done */
    if (USB_Get_IntStatus(USB_INT_EP0_OUT_DONE)) {
        if (!USB_Is_EPx_RDY_Free(0)) {
            USB_DC_LOG_DBG("ep0 out busy\r\n");
            return;
        }
        USB_Clr_IntStatus(USB_INT_EP0_OUT_DONE);
        usbd_event_notify_handler(USB_DC_EVENT_EP0_OUT_NOTIFY, NULL);
        USB_Set_EPx_Rdy(EP_ID0);
        return;
    }

    /* sof */
    if (USB_Get_IntStatus(USB_INT_SOF)) {
        USB_Clr_IntStatus(USB_INT_SOF);
        usbd_event_notify_handler(USB_DC_EVENT_SOF, NULL);
        return;
    }

    /* reset */
    if (USB_Get_IntStatus(USB_INT_RESET)) {
        USB_Clr_IntStatus(USB_INT_RESET);
        uint32_t tmpVal = BL_RD_REG(USB_BASE, USB_INT_MASK);
        tmpVal |= 0x00fffc00;
        BL_WR_REG(USB_BASE, USB_INT_MASK, tmpVal);
        tmpVal = BL_RD_REG(USB_BASE, USB_INT_EN);
        tmpVal |= 0x00fffc00;
        BL_WR_REG(USB_BASE, USB_INT_EN, tmpVal);
        usbd_event_notify_handler(USB_DC_EVENT_RESET, NULL);
        return;
    }

    /* reset end */
    if (USB_Get_IntStatus(USB_INT_RESET_END)) {
        USB_Clr_IntStatus(USB_INT_RESET_END);
        USB_Set_EPx_Rdy(EP_ID0);
        return;
    }

    /* vbus toggle */
    if (USB_Get_IntStatus(USB_INT_VBUS_TGL)) {
        USB_Clr_IntStatus(USB_INT_VBUS_TGL);
        return;
    }
#ifdef ENABLE_LPM_INT
    /* LPM wakeup */
    if (USB_Get_IntStatus(USB_INT_LPM_WAKEUP)) {
        USB_Clr_IntStatus(USB_INT_LPM_WAKEUP);
        return;
    }

    /* LPM packet */
    if (USB_Get_IntStatus(USB_INT_LPM_PACKET)) {
        /*************************************/
        /* Force low-power mode in the macrocell */
        if (USB_Get_IntStatus(USB_INT_LPM_WAKEUP) == 0) {
        }

        /*************************************/
        USB_Clr_IntStatus(USB_INT_LPM_PACKET);
        return;
    }
#endif
#ifdef ENABLE_SOF3MS_INT
    /* lost 3 SOF */
    if (USB_Get_IntStatus(USB_INT_LOST_SOF_3_TIMES)) {
        USB_DC_LOG_ERR("Lost 3 SOFs\r\n");
        /*************************************/
        /*************************************/
        USB_Clr_IntStatus(USB_INT_LOST_SOF_3_TIMES);
        return;
    }
#endif
#ifdef ENABLE_ERROR_INT
    /* error */
    if (USB_Get_IntStatus(USB_INT_ERROR)) {
        USB_DC_LOG("USB bus error 0x%08x; EP2 fifo status 0x%08x\r\n", *(volatile uint32_t *)(0x4000D81C), *(volatile uint32_t *)(0x4000D920));
        /*************************************/
        /*************************************/
        usbd_event_notify_handler(USB_DC_EVENT_ERROR, NULL);
        USB_Clr_IntStatus(USB_INT_ERROR);
        return;
    }
#endif
}
